/******************************************************************************
 * @文件  : irmptime.h
 * @作者  : caochao
 * @日期  : 22-9-2017
 * @摘要  : 这个h文件时对定时器相关宏定义的设置
 *
 * 修改人 :
 *  日期  :
 *
 * 修改人 :
 *  日期  :
 *****************************************************************************/
#ifndef _IRMPTIME_H
#define _IRMPTIME_H

/*---------------------------定时器相关宏定义---------------------------------*/
#define  IRMP_TIME_PORT     TIM2
#define  IRMP_TIME_IRQn     TIM2_IRQn
#define  IRMP_TIME_PERIPH   RCC_APB1Periph_TIM2

/*---------------------------定时器函数--------------------------------------*/
void irmp_timer_init (void);

#endif/*irmptime.h*/
/*********************************文件结束**************************************/
